trunk/SGE/app/controllers/alunos_controller.rb

SELECT * FROM `alunos`
---
  def index
    @alunos = Aluno.all

SELECT * FROM `alunos` WHERE (`alunos`.`id` = 1)
---
  def consultar
    @aluno = Aluno.find(params[:id])

SELECT * FROM `alunos` WHERE (`alunos`.`id` = 1)
---
  def editar
    @aluno = Aluno.find(params[:id])

INSERT INTO `alunos` (`content_type`, `matricula`, `updated_at`, `curso_id`, `nome`, `image_name`, `created_at`, `image_bin_data`) VALUES(NULL, 'teste', '2010-06-25 00:15:56', 4, 'teste', NULL, '2010-06-25 00:15:56', NULL)
---
  def create
    @aluno = Aluno.new(params[:aluno])

    respond_to do |format|
      if @aluno.save

SELECT * FROM `alunos` WHERE (`alunos`.`id` = 1)
UPDATE `alunos` SET `matricula` = 'teste2222', `updated_at` = '2010-06-18 00:53:41' WHERE `id` = 1
---
  def update
    @aluno = Aluno.find(params[:id])

    respond_to do |format|
      if @aluno.update_attributes(params[:aluno])

SELECT id, nome, matricula, curso_id FROM `alunos` WHERE ((UPPER(nome) LIKE UPPER('%teste%')) )
SELECT id, nome, matricula, curso_id FROM `alunos`
---
  def pesquisar
    if !params[:nome].nil? or !params[:matricula].nil? or !params[:curso_id].nil?
      conditions = [""]
      sql = ""
      if !params[:nome].empty?
        sql = sql + "(UPPER(nome) LIKE UPPER(?)) AND "
        conditions <<  "%#{params[:nome]}%"
      end
      if !params[:matricula].empty?
        sql = sql + "(UPPER(matricula) LIKE UPPER(?)) AND "
        conditions << "%#{params[:matricula]}%"
      end
      if !params[:curso_id].empty?
        sql = sql + "curso_id = ? AND "
        conditions << "#{params[:curso_id]}"
      end
      conditions[0] = sql[0..sql.length-5]
      @alunos = Aluno.find(:all, :select => ('id, nome, matricula'), :conditions => conditions)
      if @alunos.empty?

SELECT * FROM `alunos` WHERE (`alunos`.`id` = 2)
---
  def code_image
    @aluno = Aluno.find(params[:id])