trunk/SGE/app/controllers/cursos_controller.rb

  def consultar
    @curso = Curso.find(params[:id])
---
SELECT * FROM `cursos` WHERE (`cursos`.`id` = 2)

  def editar
    @curso = Curso.find(params[:id])
---
SELECT * FROM `cursos` WHERE (`cursos`.`id` = 2)

  def create
    @curso = Curso.new(params[:curso])

    respond_to do |format|
      if @curso.save
---
INSERT INTO `cursos` (`updated_at`, `total_horas`, `nome`, `coordenador`, `turno`, `ementa`, `descricao`, `tipo`, `duracao`, `created_at`) VALUES('2010-06-11 00:21:02', NULL, 'Teste 1', '', '', 'Ementa 1', 'Descricao 1', '', NULL, '2010-06-11 00:21:02')

  def update
    @curso = Curso.find(params[:id])

    respond_to do |format|
      if @curso.update_attributes(params[:curso])
---
SELECT * FROM `cursos` WHERE (`cursos`.`id` = 6)
UPDATE `cursos` SET `tipo` = 'Graduação', `turno` = 'Teste 3', `coordenador` = 'Teste 3', `duracao` = 345, `total_horas` = 45, `updated_at` = '2010-06-20 04:22:18' WHERE `id` = 4

  def pesquisar
    if !params[:nome].nil? or !params[:descricao].nil? or !params[:ementa].nil?
      conditions = [""]
      sql = ""
      if !params[:nome].empty?
        sql = sql + "(UPPER(nome) LIKE UPPER(?)) AND "
        conditions <<  "%#{params[:nome]}%"
      end
      if !params[:descricao].empty?
        sql = sql + "(UPPER(descricao) LIKE UPPER(?)) AND "
        conditions << "%#{params[:descricao]}%"
      end
      if !params[:ementa].empty?
        sql = sql + "(UPPER(ementa) LIKE UPPER(?)) AND "
        conditions << "%#{params[:ementa]}%"
      end
      conditions[0] = sql[0..sql.length-5]
      @cursos = Curso.find(:all, :conditions => conditions)
      if @cursos.empty?
---
SELECT * FROM `cursos` WHERE ((UPPER(descricao) LIKE UPPER('%1%')) AND (UPPER(ementa) LIKE UPPER('%1%')) )
SELECT * FROM `cursos`