trunk/SGE/app/controllers/matriculas_controller.rb

  def consultar
    @matricula = Matricula.find(params[:id])
---
SELECT * FROM `matriculas` WHERE (`matriculas`.`id` = 1)

  def matricular
    @matricula = Matricula.new
    @aluno = Aluno.find(params[:id])
---
SELECT * FROM `alunos` WHERE (`alunos`.`id` = 1)

  def create
    @matricula = Matricula.new(params[:matricula])
    data = Time.new
    matricula = String(data.year) + String(@matricula.turma.curso_id) + String(@matricula.aluno_id)
    session[:matricula] = matricula
    respond_to do |format|
      session[:turma_id] = @matricula.turma_id
      if esta_matriculado?
        flash[:notice] = "O aluno ja esta amtriculado neste curso"
        redirect_to(matricular_aluno_path(session[:aluno_id]))
      else
        @matricula.matricula = session[:matricula]
        if @matricula.save
---
INSERT INTO `matriculas` (`matricula`, `updated_at`, `aluno_id`, `turma_id`, `created_at`) VALUES('-47122', '2010-07-08 23:49:00', NULL, 1, '2010-07-08 23:49:00')