trunk/SGE/app/controllers/turmas_controller.rb

  def index
    @turmas = Turma.all
---
SELECT * FROM `turmas`

  def consultar
    @turma = Turma.find(params[:id])
---
SELECT * FROM `turmas` WHERE (`turmas`.`id` = 1)

  def editar
    @turma = Turma.find(params[:id])
---
SELECT * FROM `turmas` WHERE (`turmas`.`id` = 1)

  def create
    @turma = Turma.new(params[:turma])

    respond_to do |format|
      if @turma.save
---
INSERT INTO `turmas` (`curso_id`, `updated_at`, `ano`, `nome`, `max_alunos`, `created_at`) VALUES(NULL, '2010-07-08 22:45:12', '2010', '1SI1', 30, '2010-07-08 22:45:12')

  def update
    @turma = Turma.find(params[:id])

    respond_to do |format|
      if @turma.update_attributes(params[:turma])
---
SELECT * FROM `turmas` WHERE (`turmas`.`id` = 1)
UPDATE `turmas` SET `curso_id` = 2, `updated_at` = '2010-07-08 23:07:43' WHERE `id` = 1

  def pesquisar
    if !params[:nome].nil? or !params[:curso_id].nil?
      conditions = [""]
      sql = ""
      if !params[:nome].empty?
        sql = sql + "(UPPER(nome) LIKE UPPER(?)) AND "
        conditions <<  "%#{params[:nome]}%"
      end
      if !params[:curso_id].empty?
        sql = sql + "curso_id = ? AND "
        conditions <<  "%#{params[:curso_id]}%"
      end
      conditions[0] = sql[0..sql.length-5]
      @turmas = Turma.find(:all, :select => ('id, nome'), :conditions => conditions)
---
SELECT id, nome FROM `turmas` WHERE ((UPPER(nome) LIKE UPPER('%s%')) )