trunk/SGE_v0.2/app/controllers/cursos_controller.rb

  def consultar
    @curso = Curso.find(params[:id])
---
SELECT `cursos`.* FROM `cursos` WHERE (`cursos`.`id` = 2) LIMIT 1

  def editar
    @curso = Curso.find(params[:id])
---
SELECT `cursos`.* FROM `cursos` WHERE (`cursos`.`id` = 1) LIMIT 1

  def create
    @curso = Curso.new(params[:curso])

    respond_to do |format|
      if @curso.save
---
INSERT INTO `cursos` (`coordenador`, `created_at`, `descricao`, `duracao`, `ementa`, `nome`, `tipo`, `total_horas`, `turno`, `updated_at`) VALUES ('a', '2010-09-30 23:45:39', 'a', 10, 'a', 'Direito', 'Graduação', 10, 'Manhã', '2010-09-30 23:45:39')

  def pesquisar
    if !params[:nome].nil? or !params[:descricao].nil? or !params[:ementa].nil?
      conditions = [""]
      sql = ""
      if !params[:nome].empty?
        sql = sql + "(UPPER(nome) LIKE UPPER(?)) AND "
        conditions <<  "%#{params[:nome]}%"
      end
      if !params[:descricao].empty?
        sql = sql + "(UPPER(descricao) LIKE UPPER(?)) AND "
        conditions << "%#{params[:descricao]}%"
      end
      if !params[:ementa].empty?
        sql = sql + "(UPPER(ementa) LIKE UPPER(?)) AND "
        conditions << "%#{params[:ementa]}%"
      end
      conditions[0] = sql[0..sql.length-5]
      @cursos = Curso.find(:all, :conditions => conditions)
---
SELECT `cursos`.* FROM `cursos` WHERE ((UPPER(nome) LIKE UPPER('%s%')) )