trunk/SGE_v0.2/app/controllers/disciplinas_controller.rb

SELECT `disciplinas`.* FROM `disciplinas`
---
  def index
    @disciplinas = Disciplina.all

SELECT `disciplinas`.* FROM `disciplinas` WHERE (`disciplinas`.`id` = 1) LIMIT 1
---
  def consultar
    @disciplina = Disciplina.find(params[:id])

SELECT `disciplinas`.* FROM `disciplinas` WHERE (`disciplinas`.`id` = 1) LIMIT 1
---
  def editar
    @disciplina = Disciplina.find(params[:id])

INSERT INTO `disciplinas` (`bibliografia`, `created_at`, `curso_id`, `ementa`, `nome`, `sigla`, `updated_at`) VALUES ('', '2010-09-30 21:46:04', NULL, '', 'teste', '', '2010-09-30 21:46:04')
---
  def create
    @disciplina = Disciplina.new(params[:disciplina])

    respond_to do |format|
      if @disciplina.save

SELECT `disciplinas`.* FROM `disciplinas` WHERE (`disciplinas`.`id` = 1) LIMIT 1
UPDATE `disciplinas` SET `nome` = 'teste2', `updated_at` = '2010-09-30 22:12:41' WHERE (`disciplinas`.`id` = 1)
---
  def update
    @disciplina = Disciplina.find(params[:id])

    respond_to do |format|
      if @disciplina.update_attributes(params[:disciplina])

SELECT id, nome, curso_id FROM `disciplinas` WHERE ((UPPER(nome) LIKE UPPER('%e%')) AND curso_id = '%%' )
---
  def pesquisar
    if !params[:nome].nil? or !params[:curso_id].nil?
      conditions = [""]
      sql = ""
      if !params[:nome].empty?
        sql = sql + "(UPPER(nome) LIKE UPPER(?)) AND "
        conditions <<  "%#{params[:nome]}%"
      end
      if !params[:curso_id].empty?
        sql = sql + "curso_id = ? AND "
        conditions <<  "#{params[:curso_id]}"
      end
      conditions[0] = sql[0..sql.length-5]
      @disciplinas = Disciplina.find(:all, :select => ('id, nome, curso_id'), :conditions => conditions)