trunk/SGE_v0.2/app/controllers/turmas_controller.rb

  def index
    @turmas = Turma.all
---
SELECT `turmas`.* FROM `turmas`

  def consultar
    @turma = Turma.find(params[:id])
---
SELECT `turmas`.* FROM `turmas` WHERE (`turmas`.`id` = 1) LIMIT 1

  def editar
    @turma = Turma.find(params[:id])
---
SELECT `turmas`.* FROM `turmas` WHERE (`turmas`.`id` = 1) LIMIT 1

  def create
    @turma = Turma.new(params[:turma])

    respond_to do |format|
      if @turma.save
---
INSERT INTO `turmas` (`ano`, `created_at`, `curso_id`, `max_alunos`, `nome`, `updated_at`) VALUES ('2010', '2010-09-22 22:42:39', 1, 95, 'Teste', '2010-09-22 22:42:39')

  def pesquisar
    if !params[:nome].nil? or !params[:ano].nil? or !params[:curso_id].nil?
      conditions = [""]
      sql = ""
      if !params[:nome].empty?
        sql = sql + "(UPPER(nome) LIKE UPPER(?)) AND "
        conditions <<  "%#{params[:nome]}%"
      end
      if !params[:ano].empty?
        sql = sql + "ano = ? AND "
        conditions <<  "#{params[:ano]}"
      end
      if !params[:curso_id].empty?
        sql = sql + "curso_id = ? AND "
        conditions <<  "#{params[:curso_id]}"
      end
      conditions[0] = sql[0..sql.length-5]
      @turmas = Turma.find(:all, :select => ('id, nome, ano, curso_id'), :conditions => conditions)
---
SELECT id, nome, ano, curso_id FROM `turmas` WHERE ((UPPER(nome) LIKE UPPER('%s%')) )