trunk/SGE_v0.2/app/controllers/usuarios_controller.rb

  def login
    if !params[:usuario].nil?
      session[:usuario] = params[:usuario]['nome']
      senha = Digest::SHA1.hexdigest(session[:salt] + params[:usuario]['senha'])
      @usuario = Usuario.find(:all, :select => ('id, administrador'),
        :conditions => ["nome = ? AND senha = ?", params[:usuario]['nome'], senha])
---
SELECT id, administrador FROM `usuarios` WHERE (usuario = 'admin' AND senha = '7590398afbfc46cb023328636b81ea2c41387577')

  def index
    @usuarios = Usuario.all
---
SELECT `usuarios`.* FROM `usuarios`

  def consultar
    @usuario = Usuario.find(params[:id])
---
SELECT `usuarios`.* FROM `usuarios` WHERE (`usuarios`.`id` = 2) LIMIT 1

  def editar
    @usuario = Usuario.find(params[:id])
---
SELECT `usuarios`.* FROM `usuarios` WHERE (`usuarios`.`id` = 2) LIMIT 1

  def create
    @usuario = Usuario.new(params[:usuario])

    respond_to do |format|
      if @usuario.save
---
INSERT INTO `usuarios` (`administrador`, `created_at`, `nome`, `senha`, `updated_at`) VALUES (1, '2010-10-04 23:07:59', 'barbafh', '1106b9ee381bfafaed28004819c0e192cbb9212f', '2010-10-04 23:07:59')

  def update
    @usuario = Usuario.find(params[:id])

    respond_to do |format|
      if @usuario.update_attributes(params[:usuario])
---
SELECT `usuarios`.* FROM `usuarios` WHERE (`usuarios`.`id` = 2) LIMIT 1
UPDATE `usuarios` SET `administrador` = 1, `updated_at` = '2010-10-04 20:45:29' WHERE (`usuarios`.`id` = 1)

  def pesquisar
    if !params[:usuario].nil?
      conditions = [""]
      sql = ""
      if !params[:usuario].empty?
---
SELECT id, nome FROM `usuarios` WHERE ((UPPER(nome) LIKE UPPER('%a%')) )