trunk/SGE_v0.2/app/controllers/usuarios_controller.rb

SELECT `usuarios`.* FROM `usuarios` WHERE (`usuarios`.`nome` = 'teste') LIMIT 1
UPDATE `usuarios` SET `senha` = 'db5bd192f5a78af51600320cbe86782001188436', `updated_at` = '2010-10-04 19:44:52' WHERE (`usuarios`.`id` = 1)
---
  def mudar_senha
    if !params[:nova_senha].nil? or !params[:nova_senha2].nil?
      respond_to do |format|
        if params[:nova_senha] == params[:nova_senha2]
          senha = Digest::SHA1.hexdigest(session[:salt] + params[:nova_senha])
          @usuario = Usuario.find_by_nome(session[:usuario]['nome'])
          if @usuario.update_attribute('senha', senha)

SELECT `usuarios`.* FROM `usuarios`
---
  def reports
    @table = Usuario.report_table(:all)
    unless @table.empty?