SGE_v0.2/app/controllers/alunos_controller.rb

SELECT `alunos`.* FROM `alunos`
---
  def index
    @alunos = Aluno.all

SELECT `alunos`.* FROM `alunos` WHERE (`alunos`.`id` = 1) LIMIT 1
---
  def consultar
    @aluno = Aluno.find(params[:id])

SELECT `alunos`.* FROM `alunos` WHERE (`alunos`.`id` = 1) LIMIT 1
---
  def editar
    @aluno = Aluno.find(params[:id])

INSERT INTO `alunos` (`bairro`, `cep`, `cert_militar`, `cert_nascimento`, `cidade`, `complemento`, `cpf`, `created_at`, `email`, `endereco`, `estado_civil`, `foto_bin_data`, `foto_content_type`, `foto_nome`, `historico_escolar`, `historico_medico`, `identidade`, `nacionalidade`, `nome`, `nome_mae`, `nome_pai`, `nome_responsavel`, `profissao`, `sexo`, `tel_celular`, `tel_residencial`, `uf`, `updated_at`) VALUES ('', NULL, '', '', '', '', NULL, '2010-09-24 03:38:56', '', '', '', NULL, NULL, NULL, '', '', '', '', 'asdasdasdas', '', '', '', '', '', '', '', '', '2010-09-24 03:38:56')
---
  def create
    @aluno = Aluno.new(params[:aluno])

    respond_to do |format|
      if @aluno.save

SELECT id, nome FROM `alunos` WHERE ((UPPER(nome) LIKE UPPER('%a%')) )
SELECT id, nome FROM `alunos`
---
  def pesquisar
    if !params[:nome].nil? or !params[:matricula].nil? or !params[:curso_id].nil?
      conditions = [""]
      sql = ""
      if !params[:nome].empty?
        sql = sql + "(UPPER(nome) LIKE UPPER(?)) AND "
        conditions <<  "%#{params[:nome]}%"
      end
      conditions[0] = sql[0..sql.length-5]
      @alunos = Aluno.find(:all, :select => ('id, nome'), :conditions => conditions)
      if @alunos.empty?

SELECT `alunos`.* FROM `alunos` WHERE (`alunos`.`id` = 1) LIMIT 1
---
  def code_image
    @aluno = Aluno.find(params[:id])