SGE_v0.2/app/controllers/disciplinas_controller.rb

  def index
    @disciplinas = Disciplina.all
---
SELECT `disciplinas`.* FROM `disciplinas`

  def create
    @disciplina = Disciplina.new(params[:disciplina])

    respond_to do |format|
      if @disciplina.save
---
INSERT INTO `disciplinas` (`bibliografia`, `created_at`, `curso_id`, `ementa`, `nome`, `sigla`, `updated_at`) VALUES ('', '2010-09-30 21:46:04', NULL, '', 'teste', '', '2010-09-30 21:46:04')

  def update
    @disciplina = Disciplina.find(params[:id])

    respond_to do |format|
      if @disciplina.update_attributes(params[:disciplina])
---
SELECT `disciplinas`.* FROM `disciplinas` WHERE (`disciplinas`.`id` = 1) LIMIT 1
UPDATE `disciplinas` SET `nome` = 'teste2', `updated_at` = '2010-09-30 22:12:41' WHERE (`disciplinas`.`id` = 1)