SGE_v0.2/app/controllers/matriculas_controller.rb

SELECT `matriculas`.* FROM `matriculas` WHERE (`matriculas`.`id` = 1) LIMIT 1
---
  def consultar
    @matricula = Matricula.find(params[:id])

SELECT `alunos`.* FROM `alunos` WHERE (`alunos`.`id` = 1) LIMIT 1
---
  def matricular
    @lista = Turma.find(:all)
    @matricula = Matricula.new
    @aluno = Aluno.find(params[:id])

INSERT INTO `matriculas` (`aluno_id`, `created_at`, `matricula`, `turma_id`, `updated_at`) VALUES (1, '2010-09-24 03:39:28', '201011', 1, '2010-09-24 03:39:28')
---
  def create
    @matricula = Matricula.new(params[:matricula])
    data = Time.new
    matricula = String(data.year) + String(@matricula.turma.curso_id) + String(@matricula.aluno_id)
    session[:matricula] = matricula
    respond_to do |format|
      session[:turma_id] = @matricula.turma_id
      if nao_esta_matriculado?
        @matricula.matricula = session[:matricula]
        if @matricula.save