SGE_v0.2/app/controllers/usuarios_controller.rb

SELECT id, administrador FROM `usuarios` WHERE (nome = 'admin' AND senha = '7590398afbfc46cb023328636b81ea2c41387577')
---
  def login
    if !params[:nome].nil? or !params[:senha].nil?
      senha = Digest::SHA1.hexdigest(session[:salt] + params[:senha])
      @usuario = Usuario.find_by_nome(params[:nome])

SELECT `usuarios`.* FROM `usuarios` WHERE (`usuarios`.`nome` = 'teste') LIMIT 1
UPDATE `usuarios` SET `senha` = 'db5bd192f5a78af51600320cbe86782001188436', `updated_at` = '2010-10-04 19:44:52' WHERE (`usuarios`.`id` = 1)
---
  def mudar_senha
    if !params[:nova_senha].nil? or !params[:nova_senha2].nil?
      respond_to do |format|
        if params[:nova_senha] == params[:nova_senha2]
          senha = Digest::SHA1.hexdigest(session[:salt] + params[:nova_senha])
          @usuario = Usuario.find_by_nome(session[:usuario]['nome'])
          if @usuario.update_attribute('senha', senha)

SELECT `usuarios`.* FROM `usuarios`
---
  def index
    @usuarios = Usuario.all

SELECT `usuarios`.* FROM `usuarios` WHERE (`usuarios`.`id` = 2) LIMIT 1
---
  def consultar
    @usuario = Usuario.find(params[:id])

SELECT `usuarios`.* FROM `usuarios` WHERE (`usuarios`.`id` = 2) LIMIT 1
---
  def editar
    @usuario = Usuario.find(params[:id])

INSERT INTO `usuarios` (`administrador`, `created_at`, `nome`, `senha`, `updated_at`) VALUES (1, '2010-10-04 23:07:59', 'barbafh', '1106b9ee381bfafaed28004819c0e192cbb9212f', '2010-10-04 23:07:59')
---
  def create
    @usuario = Usuario.new(params[:usuario])

    respond_to do |format|
      if !params[:senha2].nil?
        if @usuario.senha == params[:senha2]
          @usuario.senha = Digest::SHA1.hexdigest(session[:salt] + params[:senha2])
          if @usuario.save

SELECT `usuarios`.* FROM `usuarios` WHERE (`usuarios`.`id` = 2) LIMIT 1
UPDATE `usuarios` SET `administrador` = 1, `updated_at` = '2010-10-04 20:45:29' WHERE (`usuarios`.`id` = 1)
---
  def update
    @usuario = Usuario.find(params[:id])
    @usuario.senha = Digest::SHA1.to_s(@usuario.senha)

    respond_to do |format|
      if @usuario.update_attributes(params[:usuario])

SELECT id, nome FROM `usuarios` WHERE ((UPPER(nome) LIKE UPPER('%a%')) )
SELECT id, nome FROM `usuarios`
---
  def pesquisar
    if !params[:nome].nil?
      conditions = [""]
      sql = ""
      if !params[:nome].empty?
        sql = sql + "(UPPER(nome) LIKE UPPER(?)) AND "
        conditions <<  "%#{params[:nome]}%"
      end
      conditions[0] = sql[0..sql.length-5]
      @usuarios = Usuario.find(:all, :select => ('id, nome'), :conditions => conditions)
      if @usuarios.empty?

SELECT `usuarios`.* FROM `usuarios`
---
  def reports
    @table = Usuario.report_table(:all)
    unless @table.empty?