SGE/app/controllers/matriculas_controller.rb

SELECT * FROM `matriculas` WHERE (`matriculas`.`id` = 1)
---
  def consultar
    @matricula = Matricula.find(params[:id])

SELECT * FROM `alunos` WHERE (`alunos`.`id` = 1)
---
  def matricular
    @matricula = Matricula.new
    @aluno = Aluno.find(params[:id])

INSERT INTO `matriculas` (`matricula`, `updated_at`, `aluno_id`, `turma_id`, `created_at`) VALUES('-47122', '2010-07-08 23:49:00', NULL, 1, '2010-07-08 23:49:00')
---
  def create
    @matricula = Matricula.new(params[:matricula])

    respond_to do |format|
      data = DateTime.new
      @matricula.matricula = data.year + '' + @matricula.turma.curso_id + '' + @matricula.aluno_id
      if @matricula.save